[PAD]
[UNK]
[SEP]
[CLS]
[MASK]
12
29
19
23
16
11
10
9
32
39
161
48
126
243
43
106
5
6
8
72
13
283
66
282
370
459
28
317
62
247
76
140
50
46
276
169
80
47
59
202
300
217
45
127
134
426
431
536
67
230
447
133
24
52
522
533
227
251
432
226
253
453
168
358
629
25
176
272
267
462
55
102
153
79
421
173
130
334
524
101
347
335
525
44
360
200
107
53
592
163
647
485
246
254
433
574
146
304
142
478
128
344
70
58
518
275
180
725
177
229
248
122
232
451
56
882
114
312
263
212
444
68
1006
118
481
470
782
249
457
213
115
1017
355
837
4
90
35
49
192
415
379
307
33
108
162
193
456
158
800
422
342
416
159
116
348
455
2
87
541
83
120
172
74
903
65
718
472
296
208
454
252
223
215
941
565
698
222
135
228
34
546
3
285
1188
69
279
785
314
394
794
773
606
313
277
595
42
781
336
264
350
121
354
14
618
92
552
922
266
813
220
366
1195
1475
634
553
448
75
776
345
124
221
1124
329
917
390
117
392
935
1642
471
274
406
332
442
535
521
311
804
353
82
548
771
540
467
1596
330
511
1299
255
189
812
757
89
818
583
499
31
435
57
1652
434
147
1203
1012
819
331
476
309
787
141
532
571
594
338
41
464
1259
191
1053
579
762
136
1661
1002
299
971
831
665
398
396
308
73
260
361
333
1003
635
2319
71
495
297
1277
561
295
918
93
1499
439
250
1592
119
461
691
175
131
209
224
187
241
1227
494
550
1644
591
615
1584
328
1555
915
938
2162
657
473
240
678
1178
86
734
964
965
854
424
1182
137
643
1359
365
477
575
138
1004
440
956
623
280
538
933
692
1319
519
1430
1051
380
63
671
132
998
94
1024
705
806
145
1192
1338
1068
1021
505
981
373
236
988
1864
1352
889
1290
1325
641
337
1110
37
1645
578
403
322
711
878
341
739
690
1426
233
1104
1593
853
652
1162
290
36
382
98
836
3034
40
1032
1042
761
1236
783
1759
1100
646
1640
675
989
829
123
1101
1130
1038
302
239
190
1263
626
707
706
875
1377
830
539
861
1365
1133
2643
884
2169
291
689
542
611
753
669
612
599
790
395
852
389
940
1698
1495
862
850
1958
1347
315
526
1174
1619
1326
683
270
662
466
810
1425
507
423
1
920
413
2538
1570
157
1329
405
468
196
1226
1680
1424
949
2641
1249
292
2124
1364
990
1512
319
352
113
1209
1311
265
437
1097
1275
359
262
77
736
1310
1582
357
1847
178
1635
566
1522
1575
984
1153
1132
601
914
887
1574
1239
237
1286
1107
20
864
895
909
2260
1135
1129
799
749
588
1397
474
916
397
1223
590
593
760
1667
1121
679
719
99
1600
374
1536
493
1403
1027
2213
921
1274
653
744
784
310
2006
1059
500
881
367
91
877
156
1405
823
808
148
30
2175
491
1228
693
1675
980
1935
788
261
723
625
1370
573
144
642
483
1013
1287
95
969
225
1193
1648
1794
955
1160
945
1525
1496
979
826
817
1903
1245
1207
1087
1085
2415
1758
1048
369
1089
798
684
197
2483
1141
281
2420
919
2436
1431
947
2037
105
1440
1154
349
356
1928
741
1610
609
1322
458
1732
1446
682
1361
1213
1803
1493
674
2418
2089
661
7
1050
2583
2113
1168
849
166
2636
2879
602
672
598
534
1438
904
824
1116
708
1556
767
1491
1094
959
880
81
2283
1553
568
1125
2170
2059
1453
1899
1770
1366
2732
1268
2421
2351
1389
754
506
972
613
100
1478
288
531
603
1934
1497
885
231
64
1786
393
722
411
1769
1622
1545
1506
371
155
1001
149
1282
856
503
475
2208
961
966
859
640
729
517
2909
1041
822
2290
1534
1324
1479
888
2008
1894
438
1822
873
1461
327
1760
1706
1476
1394
1581
1170
1450
1080
502
1881
1868
1588
777
235
2210
2197
1092
97
2066
1568
649
2250
1649
650
301
2041
1985
1235
1022
3284
2434
942
174
3444
1618
2409
408
710
1009
1233
772
1231
1139
586
554
648
2187
1993
1470
2448
991
1842
1811
1415
2023
1354
907
1401
928
449
1206
3917
811
809
1723
1105
1057
1763
1804
1666
986
726
2334
1819
1134
3173
899
770
3381
2235
1877
3289
1272
381
186
1832
1307
732
323
2460
1500
1190
497
1603
214
181
2229
1267
644
559
508
3452
1918
1383
520
482
1378
614
2363
523
2764
1345
479
384
22
1353
1801
428
2198
2042
1854
412
446
54
2069
1701
1672
1643
1331
109
1276
963
1883
1787
1870
1106
962
2612
2172
1564
832
78
2746
2575
378
2820
655
2000
1948
1990
1517
1145
2349
1780
1445
1411
1300
194
2038
1793
2572
687
651
567
486
443
15
1164
1158
906
840
3882
2945
1551
1295
3331
866
3478
2046
1662
1058
60
21
3171
1693
791
620
608
2328
1323
1252
925
897
704
2214
1448
1198
636
2047
1016
967
216
624
589
3931
512
170
1613
855
600
560
2601
1812
1507
1332
673
4108
2487
750
205
3026
2309
1798
1653
1421
1211
968
1988
1789
1654
2471
2116
1636
1396
2595
2403
1219
1180
977
164
1660
1650
937
218
2885
2667
1562
1075
219
179
110
2111
1576
1251
1025
795
792
779
745
632
286
2992
1063
465
1756
1632
1210
1208
1045
758
1795
1466
1201
872
376
1943
926
427
2570
2056
1376
1183
740
3138
1123
958
463
4942
3544
2280
1724
851
2022
1731
1047
3087
2828
2706
2681
2109
844
821
3950
3361
3096
3092
2816
2807
2401
2306
1467
1363
1294
1242
3702
923
3105
3093
2611
1514
1109
664
515
104
3492
2918
2600
2181
1527
1388
999
709
4079
3024
2604
2590
2080
2039
1907
1509
1368
1316
551
3750
1685
4622
4262
2536
2346
1583
1391
2765
1671
1184
3856
3828
2535
3270
2655
2122
2114
1577
1381
1008
326
2731
2454
2126
2029
838
828
3271
1878
1248
975
954
372
2779
2704
2470
2464
2125
1745
1651
1163
805
2613
2098
2065
1243
269
2580
2354
1559
939
724
318
2067
1518
1019
441
154
2707
2679
630
543
242
4635
2687
2527
1817
1205
1055
3804
2317
1816
1011
890
436
429
287
3016
751
1728
1414
584
3151
1035
973
825
484
340
2682
2316
2269
1872
1699
1456
185
2860
2799
2776
1913
1367
211
3329
2996
2102
1834
1088
1072
766
402
1696
1572
1526
871
848
4681
3639
2616
2407
2375
1465
324
188
18
2119
1774
1684
1328
3919
1061
3617
3308
2921
2813
1967
1839
1665
1615
1382
1362
1302
5168
3669
2463
2347
2152
1851
1473
1422
1015
670
1144
702
681
4141
3479
4727
2327
1920
1747
1656
3474
2692
2177
2075
1919
1605
1501
1333
1200
1128
3954
3013
2191
1788
1705
2017
1688
759
645
3829
3714
3620
1647
1597
1186
886
803
4091
2882
2680
2061
1278
883
3402
1829
1687
1626
1031
948
582
4682
2949
2835
1222
1037
489
3043
2073
1682
727
469
5070
3604
2121
1567
993
676
514
4224
3470
3224
2693
2343
2178
1739
1412
545
5307
2988
2769
1995
1905
1858
1646
1585
802
386
3738
3175
2288
2281
1710
1398
1054
417
3667
3315
738
3748
2540
1996
1954
1264
1194
622
4369
4160
3797
3543
3062
2573
2397
2209
2148
1911
1729
1387
363
17
4092
3074
2718
2077
1857
1802
527
203
4252
4207
2987
2308
2117
2115
2027
1906
1805
985
953
528
278
139
5249
5066
4894
3641
2906
2176
1504
1283
4324
3611
3248
2912
1874
256
3215
3123
2585
2513
2320
2030
2011
1488
1462
420
4337
3918
3724
3581
2984
2658
2358
1676
1336
5257
4000
3116
3041
2789
2773
2615
2272
1142
1036
5158
4015
3143
2957
2785
2449
2289
879
4781
4230
3498
3276
2864
2629
2504
2408
2074
2060
1464
1416
1256
995
960
715
680
6269
5553
4891
3747
3316
2833
2105
1147
633
480
4226
2940
2501
2369
1637
1443
1321
1014
425
6461
4019
2392
1624
1189
569
5980
5912
5624
5145
3141
2795
2405
2142
1718
1520
1358
876
271
6002
5194
4596
4468
3168
2819
2806
2560
2156
2005
450
6100
5325
3964
3253
1543
797
5439
3368
3359
3343
2630
2361
2357
1929
1625
1379
1260
544
501
487
273
3898
3494
2082
1730
1702
1528
1400
1034
931
580
8092
7106
6755
5354
4325
4068
3920
3502
2850
2192
1998
1023
320
4175
4136
3814
3701
2866
2534
2461
1463
728
3375
3340
3250
3220
2775
2745
2101
1833
1664
1560
1304
1120
1007
857
748
339
234
160
5105
4749
4691
3679
3162
2979
2656
2626
2598
2488
2411
2333
2291
2230
2190
1979
1814
1369
1320
572
460
4858
4299
4169
2973
2472
2045
1748
1185
1136
775
730
151
5967
5531
3871
3514
2830
2400
2282
2019
1972
1914
1548
842
796
171
5312
4195
3970
2727
2241
1902
1181
1046
488
5138
4728
4206
3559
3536
3277
3055
2845
2647
2444
2292
1835
1468
1293
577
537
383
204
96
5227
4803
4558
4163
3525
3421
3387
3360
3056
2878
2356
1976
1503
1093
970
5496
5198
4455
3883
3158
3015
2676
1970
1523
1212
616
4454
4172
4149
4097
3614
2728
2651
2610
2532
2437
1762
1547
1224
1202
1177
1119
610
596
6591
3993
3803
2688
2502
1927
1897
1686
1617
1472
1306
1049
944
929
913
833
558
5808
4405
4159
4026
3778
3761
3708
3135
2740
2686
2332
2064
1974
1709
1697
1280
1103
530
509
298
5171
4964
4834
4338
4261
3860
3757
3351
2865
2424
2244
2107
2040
2034
1796
1694
1594
1386
1137
934
617
321
4814
4355
3885
3815
3610
3608
3378
2969
2805
2596
2150
1776
1515
1452
1173
1060
930
847
419
351
6656
5084
4229
4154
4012
3709
3322
3186
2991
2839
2646
2427
2204
2165
2129
1915
1658
1240
867
816
7984
5178
4119
3458
2743
2173
2053
1940
1853
1337
1244
587
4595
4485
3978
3653
3612
3100
3027
2550
2533
2146
2076
1978
1904
1657
1317
1166
1056
6124
5293
5255
4883
4409
3675
3526
3390
3139
3129
3094
2810
2763
2670
2305
1999
1785
1773
1764
1609
1292
1159
976
893
667
8494
5264
5103
4031
3927
2631
2530
2511
2475
2130
2010
1949
1566
1563
1532
1314
165
6788
5986
5653
4652
4641
3722
3649
3417
3376
3083
2555
2414
1716
1712
1540
1484
1330
1146
150
7577
5922
5665
4704
4634
4420
3760
3588
3204
2622
2567
2138
1711
1309
1196
896
835
786
293
5787
5406
4986
4416
4025
3891
3515
3465
2757
2690
2627
2295
2261
2090
1704
1346
1284
1230
1095
1079
686
6853
5757
5300
5238
4580
4113
3925
2994
2796
2561
2315
1741
1296
1187
1157
841
6237
5344
4440
4148
3766
3755
3221
3032
2876
2355
2304
1946
1931
1800
1792
1791
1417
1150
547
4697
4557
4046
3450
3285
3154
2989
2842
2625
2193
2164
2002
1945
1852
1831
1579
1266
1221
1084
562
529
399
103
27
6306
5669
5479
4517
4456
4223
4201
3431
3070
2978
2856
2774
2609
2531
2515
2144
2013
1746
1052
621
452
7451
6936
6030
5396
4710
4642
4317
4183
4011
3960
3830
3659
3655
3652
3363
3176
3052
2995
2974
2954
2930
2869
2447
2297
2232
1395
1040
996
8040
6749
5137
4249
4106
4089
3835
3782
3407
3370
2505
2429
2417
2255
2246
2007
1818
1533
1305
1118
860
5910
5311
4288
4258
3936
3902
3775
3446
3318
3193
3086
2826
2818
2694
2574
2374
1719
1715
1655
1498
1469
1407
1350
1265
1220
1138
1074
258
6468
4818
4227
3385
3247
3183
3159
2952
2950
2938
2831
2542
2419
2399
2216
1932
1909
1790
1669
1573
1342
1315
1126
952
129
5775
5652
5628
5401
5330
5097
4958
4743
4666
4600
4374
3127
3112
3037
3025
2872
2753
2568
2546
2423
2301
2158
1884
1402
1298
1117
898
742
7215
7077
7043
6647
6442
5275
4648
4593
4110
4056
3983
3916
3625
3589
3577
2402
2224
2221
2174
1844
1460
1374
1289
1091
737
410
7538
6855
6418
5397
5200
5054
3897
3535
3296
2768
2496
2323
2160
1530
1455
1175
1077
807
306
7931
7898
7558
6604
5285
4791
4790
4474
4327
3896
3790
3451
2841
2581
2557
2336
2202
1895
1623
1602
1544
1542
1513
6473
5965
5906
5600
5253
5095
4672
4610
3923
3743
3726
3676
3661
3504
3410
2838
2724
2642
2484
2478
2366
2099
1933
1890
1871
1808
1546
1537
1516
1373
1281
1197
581
414
111
8313
7330
6926
6638
5472
4909
4640
4636
4565
4552
3957
3909
3776
3499
3217
3009
2947
2904
2870
2736
2700
2695
2412
2179
2143
2108
1923
1474
1083
992
8224
7752
6122
5974
4931
4677
4494
4471
4219
3982
3969
3943
3806
3705
3672
3342
3327
3149
3071
2824
2801
2800
2725
2578
2556
2234
2051
1880
1490
1372
1335
1270
1115
1070
401
8277
7768
7521
7445
7193
6955
6825
6474
6177
5772
5588
5498
5197
5144
4979
4618
4478
4464
4111
3995
3905
3827
3723
3593
3365
3242
3131
2998
2855
2476
2455
2145
1720
1521
1148
112
9478
6261
6017
5995
5707
5456
4831
4746
4503
4326
4282
4122
4080
3922
3678
3657
3578
3330
3241
3075
2777
2390
2299
2256
1960
1451
1169
780
294
8672
8671
8605
7081
6633
6434
6412
6140
6069
5948
5467
5125
5036
4963
4933
4929
4868
4665
4501
4231
4124
3783
3767
3576
3505
2873
2497
2128
2031
1994
1987
1944
1885
1815
1628
1229
1039
894
201
182
7603
7237
6823
6642
6073
5991
5555
5346
5324
5203
5119
4977
4766
4570
4518
4314
4146
4033
3817
3663
3481
3211
3166
2937
2678
2675
2185
2135
2092
1969
1862
1487
1237
1225
905
863
839
699
604
377
316
9303
7495
6735
6519
6384
6033
5961
5718
5684
5629
5459
5430
4981
4910
4475
4437
4331
4289
4137
3924
3716
3574
3406
3082
3079
2691
2508
2490
2338
2240
2155
2085
1722
1678
1459
1454
721
9790
8137
6866
6370
6160
5431
5334
5232
5142
4657
4613
4537
4203
4162
4088
3940
3838
3741
3461
3200
3170
3045
3002
2854
2715
2710
2662
2617
2597
2492
2307
1968
1629
1149
911
498
8153
6824
6364
6129
5878
5875
5748
5620
5516
5403
5395
5059
4902
4726
4678
4630
4216
4145
3765
3662
3405
3332
2735
2521
2432
2091
1966
1951
9268
8292
7679
7129
6798
6763
5776
5655
5502
5488
5071
4824
4759
4731
4645
4643
4062
3729
3503
3362
3292
3280
3272
3218
2788
2786
2467
1981
1887
1750
1633
1535
1510
1449
1269
1247
400
199
9934
8928
8903
8717
8197
7173
6292
5949
5566
5441
5384
5382
5267
5132
5053
5038
4983
4860
4806
4413
4204
4144
3945
3512
3122
3099
3088
2928
2843
2591
2477
2247
2153
1781
1638
1505
1355
1349
1216
1176
1111
677
619
7991
7762
7760
6615
6597
6574
6162
5908
5830
5785
5625
5473
5268
5231
5013
4930
4893
4836
4567
4523
4482
4107
3961
3949
3545
3523
3433
3430
3264
3257
3210
3036
3014
2808
2804
2798
2739
2594
2549
2267
2188
2079
2055
1962
1959
1825
1766
1549
1442
1434
1390
1114
685
627
289
10579
9053
8484
8436
8118
7799
7388
6967
6722
6411
6142
5540
5452
5393
5333
5221
5147
4936
4758
4656
4451
4391
3988
3562
3313
3267
3232
3078
2908
2868
2720
2548
2458
2433
2394
2364
1901
1879
1734
1612
1420
1392
1301
778
694
597
418
38
9785
8321
8131
7986
7975
7739
7574
7569
7527
7035
6767
6627
6496
6377
6362
6155
5702
5694
5642
5361
5313
5306
5184
5129
4973
4804
4295
4236
4188
4164
4061
4027
4002
3976
3834
3739
3693
3637
3600
3590
3022
2896
2791
2770
2589
2342
2217
2163
2071
2054
2009
1840
1683
1393
1257
1086
563
8425
8145
8114
8085
7553
7317
7202
7100
6909
6801
6710
6482
6196
6156
5988
5526
5490
5471
5295
5250
5067
5034
4879
4536
4452
4342
4241
4052
3972
3893
3886
3872
3816
3520
3350
3192
3044
3031
2825
2587
2396
2329
2298
2139
2044
1925
1713
1580
1531
1271
1098
752
10212
9352
9228
8906
8200
8181
7841
7748
7519
7468
6949
6843
6475
6405
6192
5964
5958
5850
5738
5596
5567
5323
5283
5254
5251
5237
5188
5037
5030
4992
4815
4787
4773
4735
4711
4332
4152
4103
3753
3735
3531
3524
3463
3397
3367
3306
3251
3243
3231
3161
3146
3117
3033
2976
2936
2606
2452
2018
1971
1810
1737
1385
927
735
510
198
9619
7761
7749
7682
7681
7667
7604
7325
7320
7177
7086
7038
6544
6343
6151
6021
6007
5672
5547
5537
5475
5299
5259
5252
5183
5120
4490
4460
4101
4003
3966
3866
3819
3728
3519
3466
3177
3089
2944
2849
2834
2832
2640
2446
2120
2104
2003
1850
1809
1681
1595
1413
997
846
607
430
284
11118
10966
9695
9211
8456
7833
7805
7702
7660
7246
7194
7114
7113
6969
6454
6446
6289
6248
6184
5940
5900
5891
5884
5832
5708
5627
5577
5445
5155
5069
5014
4825
4794
4660
4602
4568
4524
4421
4287
4237
4050
4024
4007
3928
3825
3740
3643
3603
3484
3469
3437
3377
3302
3209
2929
2787
2760
2721
2669
2650
2547
2541
2377
2258
2227
2084
1926
1900
1843
1775
1738
1726
1447
1399
1318
513
9989
8875
8561
8486
8400
8216
8098
7858
7759
7605
7369
7354
7298
7007
6956
6947
6902
6708
6620
6563
6547
6203
6158
5705
5679
5573
5527
5505
5294
5135
5093
5058
4994
4881
4823
4748
4673
4382
4380
4302
4278
4220
3820
3665
3613
3564
3552
3290
3268
3206
2999
2946
2744
2741
2633
2491
2371
2106
1921
1837
1721
1668
1437
1427
1408
1043
1018
957
555
85
16134
10211
10004
9307
9273
8360
8246
8233
8227
8138
7721
7484
7394
7211
7118
7033
6846
6736
6636
6625
6600
6598
6094
6024
5984
5847
5712
5648
5639
5614
5494
5442
5245
5243
4867
4546
4534
4510
4496
4444
4419
4279
4271
4117
4109
4085
4044
3736
3713
3706
3533
3522
3403
3364
3312
3299
3229
3199
3164
3119
3059
2985
2961
2901
2886
2859
2747
2657
2628
2618
2608
2558
2524
2507
2489
2473
2469
2422
2238
2093
1953
1939
1888
1489
1428
1000
868
768
663
206
11370
10997
10133
9796
9106
9050
8952
8688
8677
7856
7657
7631
7593
7583
7278
7274
7267
6667
6456
6423
6363
6271
6242
6144
6141
6132
6109
6022
5944
5923
5914
5890
5853
5513
5417
5389
5265
5207
4919
4907
4901
4896
4890
4849
4801
4800
4785
4762
4706
4644
4528
4507
4408
4208
4099
4053
3994
3991
3737
3718
3686
3485
3366
3345
3336
3219
3188
3118
2966
2920
2821
2792
2771
2738
2632
2451
2223
2166
1910
1898
1876
1856
1820
1692
1634
1404
1344
1165
858
716
712
12068
10587
10125
10067
9769
9721
9314
8259
8013
7974
7827
7826
7639
7500
7470
7413
7381
7337
7240
6921
6776
6756
6706
6686
6571
6570
6435
6316
6311
6245
5976
5928
5924
5901
5762
5695
5476
5270
5225
5083
5033
5016
5007
4984
4937
4895
4832
4625
4458
4329
4323
4264
4170
4074
4070
4037
4020
3937
3859
3844
3786
3572
3541
3529
3510
3373
3182
3126
3050
3010
3007
2892
2827
2722
2649
2599
2577
2539
2465
2462
2380
2330
2014
1529
1343
1152
557
362
125
11349
11325
10492
10477
10056
9904
9787
9673
8710
8657
8510
8476
8372
8312
7867
7842
7825
7454
7264
7150
7102
6953
6950
6848
6821
6660
6623
6472
6438
6298
6166
6133
6079
6019
6005
6003
5968
5966
5962
5931
5904
5883
5865
5833
5744
5713
5667
5415
5345
5222
5193
5179
5124
5081
4987
4922
4915
4886
4880
4859
4795
4793
4764
4661
4659
4586
4359
4356
4345
4313
4247
4168
4098
4028
3962
3930
3648
3565
3560
3467
3434
3427
3374
3372
3304
3104
3019
2953
2923
2916
2848
2582
2284
2251
2222
1827
1824
1689
1565
1261
1131
901
843
585
564
368
11599
11174
10706
10526
10462
10318
9767
9564
8584
8525
8423
8418
8394
8244
7715
7625
7350
7345
7299
7042
6818
6765
6741
6739
6652
6564
6504
6304
6270
6185
6169
6098
6081
6040
6013
5930
5889
5809
5804
5799
5770
5413
5272
4968
4914
4889
4888
4768
4763
4671
4647
4628
4476
4472
4350
4321
4156
4121
4104
4078
4058
3989
3826
3628
3475
3441
3432
3422
3338
3235
2778
2664
2663
2639
2525
2498
2384
2300
2296
2287
2279
2171
2134
2036
1916
1767
1590
1375
1262
1258
1081
943
902
892
764
720
257
14921
11991
10941
10885
10695
10546
10261
10148
9990
9964
9961
9893
9774
9603
8848
8820
8796
8754
8656
8523
8349
8325
7930
7897
7725
7691
7649
7528
7418
7406
7374
7287
7286
7258
7226
7205
7048
7029
6929
6922
6916
6827
6796
6703
6324
6277
6204
6149
6085
6016
6011
6009
5971
5959
5926
5919
5793
5788
5780
5747
5619
5608
5603
5591
5511
5487
5477
5424
5380
5341
5319
5279
5228
5211
5149
5117
4928
4911
4884
4843
4780
4737
4707
4591
4560
4535
4489
4410
4383
4376
4246
4234
4187
4063
3959
3951
3946
3895
3878
3855
3682
3670
3666
3563
3521
3509
3501
3460
3457
3314
3233
3230
3081
3066
2981
2965
2815
2759
2672
2665
2645
2607
2495
2445
2441
2389
2348
2340
2321
2243
2206
2205
2157
2103
2068
1984
1980
1963
1867
1524
1485
912
845
714
700
697
244
11840
11023
10916
10085
10072
10003
9745
9674
9664
9607
9449
9263
9150
8999
8806
8795
8729
8646
8540
8509
8440
8358
8252
8164
7871
7855
7704
7602
7561
7535
7436
7435
7358
7338
7328
7266
7250
7248
7231
7065
7030
6937
6864
6854
6832
6831
6794
6764
6748
6699
6674
6635
6467
6422
6329
6293
6287
6137
5925
5856
5800
5758
5671
5550
5481
5465
5460
5436
5416
5404
5320
5314
5296
5273
5224
5088
5026
4989
4923
4786
4783
4761
4755
4724
4723
4718
4693
4667
4620
4615
4585
4574
4559
4520
4513
4473
4465
4445
4426
4415
4273
4093
4059
4051
3914
3908
3887
3656
3645
3599
3549
3420
3341
3321
3256
3239
3237
3227
3196
3181
3021
2889
2803
2754
2652
2592
2586
2564
2552
2543
2528
2456
2386
2372
2303
2277
2140
2094
2024
2004
1991
1779
1673
1639
1608
1586
1578
1384
1161
1090
870
756
409
404
303
15727
15300
14486
14177
13793
13773
13219
11657
11594
11441
11339
11094
11084
10878
10466
10366
10032
9994
9583
9443
9238
9196
9183
9161
9060
9026
8980
8790
8774
8732
8691
8569
8482
8460
8304
8217
8116
8077
8075
8011
7892
7798
7775
7714
7662
7591
7587
7523
7479
7444
7412
7344
7340
7306
7151
7105
7074
7036
7004
6992
6971
6958
6957
6911
6903
6891
6840
6820
6809
6789
6594
6572
6512
6459
6449
6441
6397
6342
6244
6241
6227
6221
6174
5942
5934
5640
5571
5557
5545
5528
5463
5434
5357
5318
5242
5101
4835
4829
4796
4770
4699
4670
4650
4624
4527
4418
4307
4269
4268
4135
4064
4023
4021
3977
3973
3971
3752
3695
3455
3419
3382
3357
3278
3259
3195
3187
3132
2846
2793
2772
2708
2671
2588
2562
2520
2459
2365
2302
2252
2137
2025
1952
1950
1778
1179
936
407
375
14248
14071
13278
11790
11301
11236
10854
10727
10549
10306
10246
10226
10197
10186
10110
9960
9491
9427
9412
9408
9318
9285
9199
9172
9151
8826
8763
8731
8463
8420
8393
8388
8381
8322
8235
8210
8071
8012
8003
7982
7945
7823
7734
7696
7695
7584
7579
7572
7541
7482
7478
7475
7424
7419
7322
7271
7262
7257
7255
7225
7136
7116
7006
6945
6792
6753
6719
6648
6596
6580
6530
6479
6465
6464
6450
6440
6320
6301
6297
6291
6273
6224
6130
6118
6115
6063
6052
6043
5936
5806
5733
5732
5717
5691
5662
5658
5633
5538
5483
5390
5385
5356
5339
5230
5216
5210
5140
5060
5023
4978
4940
4938
4852
4821
4740
4736
4663
4547
4447
4360
4304
4221
4214
4173
4171
4143
4134
4125
4105
4087
4072
4010
4005
4004
3998
3958
3929
3894
3869
3807
3798
3794
3787
3773
3699
3694
3677
3640
3583
3550
3547
3500
3486
3261
3260
3254
3228
3185
3156
3153
3039
3028
3004
2956
2893
2862
2857
2797
2705
2637
2537
2510
2482
2457
2425
2388
2311
2168
2167
2154
1860
1620
1508
1483
1029
951
659
637
88
16451
14687
14635
14524
13574
12769
12735
12501
12447
12009
11625
11474
11399
11297
11292
11166
10751
10668
10511
10397
10382
10377
10369
10327
10314
10157
10029
9941
9848
9672
9622
9574
9482
9394
9304
9242
9224
9113
9005
8976
8922
8858
8832
8708
8698
8469
8411
8408
8380
8376
8374
8324
8203
8124
8061
7958
7868
7776
7764
7613
7607
7554
7537
7531
7458
7409
7363
7311
7220
7108
7078
7041
7019
7000
6976
6973
6952
6906
6883
6779
6757
6690
6684
6613
6568
6557
6549
6540
6517
6455
6382
6379
6349
6341
6338
6315
6299
6274
6222
6181
6135
6116
6051
6048
6031
5985
5978
5896
5882
5862
5840
5807
5766
5752
5703
5563
5517
5466
5440
5409
5374
5372
5368
5288
5260
5246
5121
5113
5104
5074
5050
4998
4985
4961
4861
4855
4732
4705
4646
4607
4514
4492
4470
4433
4368
4362
4243
4240
4212
4179
4153
4114
4102
4039
3939
3877
3846
3780
3763
3754
3727
3715
3703
3690
3635
3595
3582
3532
3507
3416
3369
3320
3317
3300
3293
3262
3258
3225
3203
3080
3076
3072
3068
3018
3005
2982
2902
2891
2881
2863
2677
2648
2621
2603
2529
2500
2376
2359
2245
2233
2220
2149
2088
2072
1938
1836
834
763
713
703
576
496
343
16389
15668
15314
14673
13972
13550
13533
13284
13044
12996
12931
12783
12722
12718
12468
12316
12291
12111
12033
11875
11727
11534
11448
11440
11215
11198
11197
11062
11027
10950
10867
10831
10799
10796
10775
10752
10739
10669
10667
10607
10596
10430
10405
10158
10048
9969
9911
9859
9799
9797
9697
9523
9446
9325
9278
9245
9215
9186
9108
9104
9101
8929
8902
8889
8870
8850
8846
8824
8618
8609
8573
8547
8333
8298
8231
8142
8132
8125
8083
8016
7970
7934
7925
7843
7828
7822
7812
7777
7772
7767
7738
7620
7619
7466
7402
7395
7295
7282
7256
7253
7243
7190
7178
7174
7089
6935
6896
6681
6673
6569
6552
6524
6471
6439
6413
6286
6256
6215
6172
6171
6150
6147
6145
6136
6110
6004
5993
5987
5846
5831
5829
5815
5765
5664
5615
5572
5546
5532
5522
5518
5512
5486
5457
5449
5408
5386
5258
5192
5111
5082
5041
5024
5001
4956
4947
4932
4812
4774
4684
4638
4579
4553
4548
4540
4463
4438
4424
4341
4336
4270
4155
4038
4032
4030
4009
4008
3944
3935
3892
3876
3842
3824
3822
3809
3808
3802
3638
3537
3489
3483
3424
3404
3380
3339
3269
3201
3160
3136
3125
3111
3098
2968
2877
2875
2840
2823
2762
2737
2698
2584
2569
2431
2410
2381
2350
2257
2226
2136
2133
2033
1989
1908
1893
1753
1714
1557
1541
1482
1471
1238
1143
1127
1113
789
639
238
143
26
14985
14980
14667
14330
13747
13712
13421
12915
12830
12629
12482
12402
12256
12203
12192
12147
12053
11814
11739
11732
11629
11583
11557
11549
11381
11330
11182
11047
11010
10980
10906
10898
10859
10782
10724
10716
10651
10557
10531
10449
10408
10400
10385
10331
10298
10279
10242
10231
10207
10171
10137
10127
10089
10077
9981
9971
9888
9838
9830
9822
9719
9685
9626
9597
9594
9541
9535
9437
9426
9401
9320
9289
9279
9175
9169
9152
9121
9056
8930
8911
8886
8865
8805
8761
8682
8648
8643
8611
8588
8548
8495
8477
8461
8457
8428
8417
8382
8375
8316
8251
8232
8215
8161
8123
8102
8089
8042
8034
8001
7961
7951
7946
7901
7880
7872
7831
7796
7795
7703
7638
7621
7588
7576
7571
7567
7529
7522
7520
7469
7459
7449
7393
7376
7357
7307
7236
7223
7216
7201
7163
7097
7082
7059
7051
7039
6983
6910
6870
6869
6865
6783
6715
6696
6692
6691
6651
6541
6500
6436
6381
6367
6366
6356
6325
6318
6308
6278
6253
6170
6152
6102
6099
6072
6014
5989
5951
5947
5877
5866
5857
5812
5774
5721
5720
5701
5700
5661
5634
5605
5590
5515
5510
5508
5480
5468
5428
5387
5359
5355
5336
5322
5241
5209
5166
5160
5133
5090
5080
5052
5047
5042
4955
4892
4878
4857
4792
4745
4709
4611
4590
4569
4533
4480
4402
4388
4351
4319
4301
4263
4257
4191
4189
4186
4180
4166
4132
4083
4081
3992
3985
3974
3956
3941
3837
3777
3762
3719
3707
3542
3508
3493
3490
3476
3471
3435
3399
3396
3273
3266
3198
3163
3067
3008
2951
2900
2871
2802
2684
2654
2593
2519
2440
2382
2352
2285
2231
1922
1865
1849
1828
1821
1744
1700
1589
1552
1494
1406
1327
1254
1030
994
891
717
210
16322
15187
14944
14367
14356
14118
14015
13870
13821
13636
13581
13453
13327
12998
12944
12861
12573
12562
12537
12361
12254
12066
11956
11901
11679
11613
11527
11382
11355
11318
11177
11176
11125
11086
11054
11009
10936
10925
10801
10730
10646
10639
10580
10522
10439
10438
10333
10305
10255
10254
10142
10113
10014
9945
9913
9881
9843
9817
9814
9776
9715
9653
9637
9618
9483
9469
9461
9452
9419
9409
9266
9218
9144
9102
9049
9046
9014
8981
8969
8958
8940
8921
8920
8741
8721
8696
8687
8681
8647
8592
8565
8521
8508
8503
8385
8357
8344
8317
8315
8296
8270
8159
8155
8121
8107
7990
7978
7911
7886
7878
7877
7852
7806
7754
7733
7719
7689
7628
7606
7590
7578
7548
7489
7218
7197
7171
7169
7122
7121
7110
7104
7014
6961
6954
6940
6927
6863
6845
6839
6838
6797
6793
6754
6734
6727
6721
6709
6672
6661
6659
6629
6614
6558
6529
6502
6462
6437
6433
6394
6389
6380
6365
6337
6335
6332
6296
6283
6218
6190
6188
6161
6148
6112
6107
6101
6087
6067
6053
6035
5975
5937
5915
5911
5858
5838
5818
5810
5798
5790
5777
5761
5734
5730
5678
5604
5569
5541
5530
5509
5448
5443
5420
5410
5381
5376
5301
5276
5235
5219
5208
5202
5022
5019
5005
4917
4905
4840
4813
4805
4799
4798
4767
4739
4714
4685
4675
4566
4519
4504
4467
4396
4358
4339
4291
4259
4248
4228
4218
4217
4178
4139
4129
4095
4054
4022
3906
3884
3851
3845
3650
3629
3602
3568
3554
3551
3548
3516
3480
3429
3395
3344
3310
3282
3279
3213
3150
3121
3058
2970
2964
2907
2817
2780
2750
2701
2634
2416
2379
2286
2218
2215
2062
2057
2020
1983
1955
1873
1826
1783
1757
1611
1598
1511
1429
1360
1357
1255
1204
1108
1078
900
820
746
733
570
259
16614
16505
16477
16231
16135
15859
15836
15489
15311
15237
15148
15067
14882
14725
14510
14504
14387
14349
14297
14246
14153
13899
13889
13719
13710
13587
13551
13493
13342
13325
13251
12848
12834
12827
12812
12764
12729
12717
12617
12603
12497
12469
12346
12312
12301
12276
12274
12271
12260
12231
12159
12127
12088
12078
12034
11978
11904
11888
11884
11799
11734
11692
11673
11602
11567
11555
11541
11507
11500
11443
11369
11296
11250
11239
11227
11220
11168
11163
11161
11046
11021
11008
10983
10975
10961
10938
10926
10895
10863
10861
10795
10742
10735
10713
10710
10707
10599
10592
10577
10559
10547
10485
10386
10329
10312
10285
10265
10160
10152
10124
10109
10107
10074
10033
9995
9988
9986
9977
9935
9923
9889
9882
9857
9834
9825
9824
9789
9739
9734
9718
9710
9708
9692
9684
9669
9634
9616
9595
9554
9546
9532
9531
9529
9502
9440
9434
9428
9410
9388
9348
9319
9310
9269
9256
9223
9214
9180
9176
9158
9157
9153
9145
9142
9111
9087
9031
9027
9019
8991
8990
8989
8967
8957
8935
8894
8888
8836
8835
8828
8804
8760
8736
8674
8666
8659
8638
8622
8601
8593
8587
8576
8568
8519
8512
8490
8458
8444
8441
8434
8311
8187
8177
8163
8088
8080
8067
8039
8008
8006
7924
7923
7859
7857
7838
7835
7783
7686
7627
7616
7601
7507
7499
7474
7462
7455
7450
7360
7359
7348
7308
7303
7301
7293
7285
7263
7251
7234
7207
7137
7131
7130
7115
7101
7098
7095
7090
7057
7027
7026
7010
6999
6941
6933
6924
6914
6861
6830
6806
6781
6761
6731
6723
6712
6671
6646
6643
6632
6599
6577
6523
6511
6488
6451
6428
6392
6340
6285
6268
6259
6180
6178
6157
6138
6088
6080
6077
6061
6039
6037
5994
5892
5820
5802
5797
5769
5763
5749
5731
5710
5677
5674
5641
5622
5609
5536
5499
5453
5450
5432
5427
5423
5383
5375
5343
5340
5291
5289
5181
5174
5173
5161
5154
5110
5096
5064
5051
4974
4967
4853
4841
4779
4712
4694
4688
4683
4674
4662
4658
4637
4623
4616
4605
4555
4551
4545
4526
4462
4449
4417
4398
4397
4395
4385
4375
4322
4292
4286
4176
4069
3965
3926
3901
3880
3879
3873
3813
3785
3768
3684
3585
3584
3567
3555
3553
3468
3447
3436
3428
3412
3411
3346
3328
3326
3301
3283
3238
3222
3172
3167
3155
3053
3048
3047
3046
3038
3035
2997
2867
2837
2822
2673
2602
2579
2522
2485
2398
2373
2370
2368
2353
2345
2273
2268
2266
2263
2259
2249
2189
2127
2087
2083
2035
1961
1924
1866
1777
1761
1733
1659
1601
1554
1253
1122
1096
793
774
701
207
183
19881
17679
17518
17337
16966
16120
16119
16048
15843
15784
15395
15207
15124
15029
14972
14825
14606
14541
14523
14519
14513
14507
14457
14448
14434
14423
14389
14372
14250
14224
14197
14104
14096
14014
13910
13847
13822
13798
13772
13714
13677
13608
13579
13548
13479
13446
13426
13417
13330
13005
12973
12971
12907
12825
12759
12749
12688
12672
12601
12500
12487
12472
12399
12352
12348
12347
12327
12323
12311
12253
12151
12128
11974
11967
11959
11928
11915
11910
11880
11864
11804
11788
11780
11779
11725
11699
11582
11560
11404
11365
11343
11342
11156
11129
11119
11108
11107
11092
11059
10993
10986
10984
10960
10927
10918
10911
10879
10871
10853
10850
10823
10813
10806
10776
10750
10744
10741
10703
10660
10655
10645
10643
10610
10600
10597
10589
10582
10550
10486
10478
10448
10406
10364
10363
10357
10310
10309
10245
10237
10222
10213
10209
10082
10063
10031
10028
10012
10009
9962
9929
9831
9773
9771
9768
9755
9751
9707
9658
9640
9625
9623
9598
9582
9575
9572
9568
9559
9558
9514
9509
9504
9501
9494
9485
9475
9471
9372
9339
9334
9333
9313
9301
9288
9280
9257
9237
9213
9093
9032
9009
9002
8994
8993
8951
8941
8938
8918
8885
8876
8854
8853
8813
8794
8783
8748
8680
8635
8575
8557
8528
8478
8450
8435
8431
8416
8410
8404
8379
8367
8354
8331
8283
8278
8275
8266
8256
8201
8196
8182
8176
8173
8150
8149
8030
8014
8009
8007
7997
7989
7981
7977
7955
7927
7918
7906
7902
7876
7866
7865
7801
7797
7765
7751
7678
7666
7661
7650
7643
7622
7615
7610
7596
7592
7568
7557
7551
7549
7514
7511
7473
7443
7428
7420
7407
7405
7343
7333
7296
7289
7279
7276
7235
7209
7198
7183
7181
7125
7094
7055
7015
6998
6997
6991
6978
6962
6959
6899
6898
6876
6858
6816
6698
6688
6664
6555
6553
6545
6520
6514
6485
6445
6431
6427
6409
6374
6373
6368
6361
6353
6352
6328
6317
6265
6249
6233
6232
6191
6126
6117
6096
6089
6086
6049
6041
6020
5982
5977
5950
5946
5945
5935
5864
5863
5845
5824
5719
5687
5685
5682
5651
5645
5637
5598
5589
5576
5575
5564
5562
5554
5506
5461
5447
5425
5411
5398
5391
5358
5287
5286
5277
5195
5176
5151
5143
5087
5086
5040
5027
5025
5010
4999
4997
4996
4976
4950
4906
4900
4897
4876
4874
4863
4856
4854
4846
4844
4820
4808
4802
4756
4753
4725
4721
4713
4692
4690
4619
4614
4604
4599
4581
4561
4538
4497
4483
4481
4431
4428
4399
4387
4379
4344
4335
4333
4293
4290
4250
4185
4140
4086
4067
4060
4057
4029
4001
3997
3987
3981
3947
3942
3921
3875
3865
3848
3831
3764
3751
3700
3674
3636
3630
3626
3587
3558
3557
3528
3511
3488
3477
3459
3440
3414
3400
3379
3298
3295
3287
3252
3249
3226
3223
3152
3145
3128
3120
3091
3060
3029
3011
2962
2948
2942
2934
2899
2874
2861
2847
2814
2766
2751
2742
2717
2714
2685
2668
2661
2614
2544
2512
2506
2486
2468
2413
2344
2312
2293
2264
2196
2186
2184
2182
2132
2081
2012
1896
1869
1841
1754
1749
1727
1599
1492
1486
1480
1441
1436
1246
1171
1076
1066
1064
1044
908
827
631
504
391
152
21285
20836
19031
18447
18344
18038
17971
17855
17678
17654
17607
17546
17305
17278
17164
16730
16602
16530
16514
16468
16270
15921
15756
15720
15717
15590
15557
15542
15490
15485
15460
15421
15316
15245
15166
15156
15040
14963
14883
14881
14782
14780
14742
14669
14648
14611
14602
14556
14540
14459
14456
14442
14432
14427
14352
14332
14228
14205
14188
14179
14123
14095
14054
14053
14004
13987
13984
13983
13952
13913
13902
13894
13864
13855
13846
13819
13806
13805
13800
13792
13789
13785
13778
13746
13681
13667
13650
13495
13485
13481
13444
13441
13436
13368
13355
13346
13345
13340
13324
13285
13276
13205
13176
13167
13165
13131
13126
13073
13061
13060
13057
13025
13012
13011
13004
13002
13001
12980
12961
12923
12911
12886
12859
12852
12841
12838
12832
12826
12819
12798
12792
12786
12761
12745
12730
12678
12676
12654
12622
12515
12511
12477
12463
12420
12380
12268
12226
12197
12176
12132
12101
12093
12071
12051
12049
12014
12006
11945
11871
11838
11816
11793
11745
11744
11735
11705
11694
11630
11607
11598
11591
11569
11539
11487
11486
11483
11473
11471
11417
11414
11340
11315
11313
11304
11293
11289
11275
11270
11253
11238
11231
11199
11194
11185
11172
11165
11159
11147
11137
11130
11071
11000
10987
10974
10959
10945
10943
10899
10890
10880
10800
10661
10630
10626
10625
10590
10574
10564
10560
10558
10541
10517
10436
10407
10393
10362
10361
10323
10300
10299
10296
10292
10238
10230
10208
10201
10190
10166
10144
10116
10096
10078
10059
10038
10010
9999
9983
9976
9933
9930
9921
9895
9865
9858
9852
9851
9850
9840
9826
9801
9794
9780
9748
9746
9699
9682
9675
9663
9612
9602
9567
9566
9547
9512
9486
9476
9439
9403
9402
9384
9369
9357
9354
9346
9330
9267
9264
9247
9241
9225
9207
9200
9198
9156
9131
9115
9103
9088
9080
9079
9078
9029
9023
8974
8960
8950
8945
8914
8872
8862
8856
8842
8833
8829
8810
8809
8770
8769
8755
8751
8734
8724
8712
8704
8693
8689
8675
8670
8665
8636
8625
8619
8616
8607
8606
8604
8562
8537
8499
8479
8424
8422
8405
8399
8392
8386
8384
8383
8348
8343
8301
8273
8245
8194
8154
8152
8144
8140
8110
8100
8094
8087
8074
8056
8055
8049
8035
8026
8024
7993
7979
7973
7969
7916
7913
7905
7899
7883
7864
7862
7817
7811
7782
7773
7731
7687
7684
7683
7673
7670
7665
7642
7612
7594
7575
7540
7533
7518
7453
7448
7438
7414
7403
7361
7347
7323
7319
7318
7277
7249
7172
7159
7157
7154
7147
7128
7092
7091
7087
7075
7054
7052
7022
7012
7011
7008
6995
6989
6948
6932
6913
6894
6885
6873
6872
6862
6850
6829
6813
6762
6726
6725
6724
6676
6669
6653
6602
6590
6585
6582
6560
6551
6546
6518
6506
6497
6469
6463
6457
6407
6400
6396
6360
6357
6355
6351
6333
6313
6300
6267
6257
6255
6243
6220
6199
6197
6194
6159
6125
6123
6119
6103
6093
6060
6058
6010
6006
5999
5972
5927
5879
5874
5872
5849
5848
5839
5827
5826
5825
5814
5811
5786
5767
5759
5754
5743
5724
5714
5711
5699
5643
5626
5597
5544
5529
5525
5514
5478
5433
5378
5377
5327
5316
5315
5304
5303
5297
5262
5256
5248
5247
5240
5239
5201
5190
5177
5175
5167
5156
5122
5109
5094
5089
5072
5048
5046
5028
5020
4939
4904
4877
4875
4848
4842
4788
4700
4669
4664
4639
4606
4601
4592
4583
4582
4562
4549
4498
4487
4477
4459
4450
4434
4432
4429
4411
4404
4386
4372
4354
4315
4305
4303
4285
4251
4244
4182
4151
4142
4130
4126
4090
4084
4045
4016
3952
3913
3890
3854
3843
3836
3832
3805
3796
3795
3758
3745
3704
3691
3689
3685
3671
3664
3616
3605
3573
3506
3462
3409
3408
3386
3384
3371
3358
3324
3305
3255
3234
3214
3174
3165
3137
3113
3061
3042
2919
2917
2913
2911
2790
2730
2703
2702
2653
2624
2566
2479
2395
2326
2325
2276
2207
2058
2052
2001
1947
1941
1930
1742
1725
1695
1641
1630
1607
1587
1458
1371
1356
1340
1339
1334
1313
1288
688
668
660
605
492
195
61
20397
20241
19192
18856
18854
18698
18696
18595
18552
18502
18399
18397
18337
18250
18087
18081
17975
17886
17865
17444
17365
17333
17308
17267
17166
17077
16971
16959
16901
16669
16658
16654
16631
16423
16404
16395
16354
16304
16163
16152
16150
16138
16047
15985
15982
15979
15970
15949
15910
15909
15904
15888
15863
15829
15801
15797
15758
15755
15744
15715
15713
15705
15704
15696
15686
15606
15562
15520
15504
15494
15492
15478
15476
15427
15408
15372
15342
15334
15333
15331
15315
15275
15268
15231
15214
15174
15167
15128
15122
15104
15000
14981
14975
14939
14934
14933
14877
14876
14862
14817
14807
14802
14786
14770
14745
14731
14705
14643
14624
14622
14590
14585
14550
14526
14445
14395
14365
14344
14327
14306
14305
14288
14264
14242
14241
14239
14235
14216
14175
14169
14162
14144
14142
14130
14127
14117
14113
14110
14094
14086
14067
14059
14049
14028
14027
14021
13994
13989
13982
13970
13943
13916
13892
13891
13890
13863
13858
13849
13842
13831
13791
13748
13732
13717
13711
13707
13706
13704
13690
13655
13647
13646
13594
13563
13555
13553
13535
13529
13518
13509
13504
13445
13423
13393
13378
13375
13373
13362
13361
13357
13326
13323
13322
13282
13273
13254
13237
13209
13196
13185
13162
13146
13123
13069
13058
13051
13047
13045
12986
12975
12974
12972
12964
12952
12948
12920
12881
12865
12862
12855
12847
12820
12813
12811
12797
12779
12751
12741
12713
12693
12669
12640
12618
12609
12591
12590
12545
12544
12532
12512
12508
12495
12491
12464
12457
12433
12425
12412
12411
12394
12390
12384
12381
12358
12354
12341
12331
12324
12322
12307
12299
12258
12251
12245
12188
12179
12150
12136
12131
12130
12119
12116
12106
12089
12081
12076
12050
12028
12004
11996
11992
11989
11984
11950
11918
11912
11860
11846
11839
11818
11773
11755
11746
11730
11729
11712
11707
11698
11646
11642
11632
11627
11615
11611
11563
11523
11520
11508
11498
11484
11476
11472
11453
11444
11439
11426
11412
11405
11403
11388
11387
11377
11356
11350
11322
11314
11311
11287
11264
11259
11248
11245
11229
11226
11196
11181
11143
11141
11140
11123
11111
11098
11089
11075
11068
11011
10998
10894
10887
10886
10876
10865
10858
10857
10852
10844
10842
10815
10807
10803
10783
10768
10749
10747
10689
10688
10659
10649
10647
10642
10634
10620
10619
10617
10608
10604
10583
10573
10542
10537
10530
10498
10481
10469
10468
10461
10447
10443
10427
10426
10422
10410
10409
10372
10371
10332
10328
10324
10316
10311
10304
10294
10284
10280
10264
10263
10260
10235
10224
10216
10214
10206
10192
10189
10178
10165
10149
10086
10081
10071
10070
10066
10064
10049
10037
10026
10019
9967
9959
9940
9939
9937
9936
9931
9920
9887
9885
9876
9839
9835
9833
9819
9813
9812
9810
9808
9793
9783
9779
9762
9761
9758
9744
9738
9736
9720
9717
9678
9666
9656
9654
9648
9646
9624
9600
9599
9592
9590
9573
9538
9525
9522
9507
9505
9500
9495
9463
9458
9448
9447
9442
9431
9407
9390
9387
9385
9383
9364
9358
9355
9353
9351
9331
9296
9291
9290
9287
9283
9274
9258
9252
9246
9221
9203
9202
9194
9191
9190
9178
9174
9155
9130
9129
9120
9114
9109
9089
9061
9058
9045
9028
9015
9001
8984
8977
8966
8949
8934
8913
8884
8851
8839
8819
8797
8787
8759
8756
8744
8706
8676
8651
8640
8637
8632
8631
8627
8602
8595
8585
8583
8572
8550
8545
8543
8542
8529
8500
8493
8491
8489
8443
8430
8429
8427
8426
8421
8412
8401
8397
8390
8378
8359
8337
8336
8335
8329
8314
8309
8303
8280
8255
8248
8243
8242
8234
8225
8218
8206
8199
8198
8195
8175
8171
8169
8168
8120
8109
8105
8101
8072
8051
8045
8029
8022
8017
7994
7985
7983
7980
7976
7967
7962
7950
7942
7938
7937
7928
7863
7850
7848
7829
7824
7793
7790
7774
7769
7753
7737
7736
7727
7726
7724
7708
7707
7697
7672
7664
7659
7654
7632
7618
7573
7566
7536
7517
7493
7487
7481
7463
7441
7440
7431
7408
7399
7378
7373
7370
7352
7346
7339
7335
7332
7327
7300
7294
7270
7269
7261
7259
7254
7244
7239
7228
7200
7185
7175
7166
7161
7156
7111
7096
7079
7072
7062
7028
7021
7001
6990
6986
6966
6960
6951
6939
6938
6928
6904
6887
6868
6841
6807
6805
6804
6803
6802
6787
6786
6775
6773
6769
6766
6751
6717
6714
6711
6702
6683
6668
6657
6655
6641
6640
6634
6624
6617
6587
6584
6579
6575
6566
6562
6535
6510
6458
6452
6430
6415
6414
6408
6372
6358
6326
6319
6262
6260
6254
6251
6240
6235
6230
6229
6216
6207
6134
6120
6114
6071
6064
6054
6047
6032
6029
6015
6008
6001
5979
5953
5943
5939
5920
5916
5895
5876
5861
5855
5835
5834
5828
5817
5789
5750
5742
5736
5704
5698
5673
5663
5657
5654
5617
5606
5586
5565
5561
5548
5542
5534
5520
5500
5482
5421
5326
5310
5263
5226
5214
5182
5169
5163
5153
5134
5106
5035
5004
5000
4990
4970
4954
4953
4935
4927
4903
4869
4851
4850
4845
4830
4789
4784
4777
4744
4715
4702
4701
4698
4655
4651
4632
4578
4530
4529
4521
4515
4512
4506
4495
4484
4469
4453
4448
4390
4349
4347
4346
4311
4310
4298
4296
4280
4275
4253
4232
4215
4213
4211
4196
4190
4138
4127
4123
4094
4049
4048
4036
4018
3999
3980
3979
3934
3907
3900
3888
3874
3870
3800
3791
3774
3717
3710
3692
3632
3518
3497
3472
3443
3425
3423
3401
3398
3392
3391
3389
3355
3349
3347
3191
3140
3090
3085
3003
2990
2977
2971
2960
2959
2941
2939
2925
2922
2910
2905
2903
2895
2888
2887
2883
2880
2836
2781
2726
2709
2683
2674
2660
2659
2565
2518
2481
2453
2426
2406
2393
2385
2362
2313
2254
2253
2236
2159
2147
2112
2100
2095
1997
1982
1917
1886
1863
1838
1797
1782
1765
1755
1736
1735
1691
1631
1341
1312
1250
1191
1151
1112
1102
1010
946
814
549
305
268
184
84
20879
20859
20768
20576
20341
20299
20287
20178
20164
20062
19969
19968
19960
19906
19842
19626
19530
19500
19445
19441
19333
19313
19250
19194
19184
19173
19144
19083
19023
18871
18749
18659
18651
18646
18599
18578
18489
18472
18443
18433
18405
18330
18327
18216
18165
18162
18143
18137
18084
18010
18006
17881
17830
17789
17785
17671
17658
17648
17631
17621
17620
17601
17530
17526
17525
17523
17498
17449
17422
17417
17416
17395
17351
17345
17334
17299
17295
17290
17262
17227
17220
17211
17196
17195
17160
17089
17072
17065
17057
17047
17037
17024
17005
16957
16943
16904
16895
16886
16846
16836
16829
16819
16780
16778
16771
16735
16729
16728
16723
16721
16717
16708
16647
16638
16636
16596
16584
16555
16551
16539
16524
16500
16472
16442
16433
16410
16402
16386
16356
16339
16329
16298
16284
16251
16236
16210
16206
16197
16195
16194
16193
16191
16190
16189
16187
16178
16160
16155
16116
16100
16088
16079
16069
16063
16056
16045
16025
16006
15998
15993
15964
15944
15941
15930
15914
15899
15879
15856
15834
15810
15793
15790
15787
15768
15757
15750
15738
15734
15692
15682
15681
15674
15671
15670
15660
15646
15642
15622
15611
15609
15583
15570
15568
15566
15555
15550
15544
15539
15517
15516
15508
15506
15496
15495
15437
15430
15415
15402
15401
15382
15381
15361
15319
15317
15313
15302
15287
15281
15260
15258
15225
15219
15217
15213
15212
15211
15164
15150
15149
15142
15138
15107
15099
15087
15086
15068
15053
15033
15030
15002
15001
14977
14959
14928
14924
14918
14916
14909
14885
14884
14875
14873
14853
14850
14846
14833
14830
14820
14795
14788
14768
14766
14762
14748
14743
14736
14722
14718
14711
14709
14702
14685
14684
14682
14681
14646
14641
14604
14596
14587
14580
14578
14565
14531
14516
14514
14498
14482
14478
14474
14468
14455
14449
14447
14428
14422
14415
14404
14388
14385
14378
14374
14371
14362
14357
14340
14339
14338
14335
14328
14325
14317
14298
14290
14287
14280
14277
14274
14265
14261
14257
14249
14238
14227
14223
14206
14199
14190
14172
14152
14148
14136
14099
14065
14062
14058
14047
14009
14006
14003
14002
13996
13967
13962
13954
13948
13941
13929
13919
13908
13907
13906
13901
13848
13840
13833
13832
13825
13809
13807
13801
13779
13767
13763
13758
13742
13741
13740
13726
13725
13720
13708
13696
13691
13688
13686
13668
13652
13645
13624
13623
13593
13546
13544
13543
13524
13516
13508
13507
13506
13503
13498
13484
13483
13478
13450
13437
13433
13419
13414
13404
13401
13400
13395
13394
13387
13372
13347
13341
13339
13312
13311
13305
13304
13287
13274
13270
13269
13264
13262
13261
13257
13256
13253
13248
13245
13236
13227
13224
13223
13213
13201
13193
13189
13184
13183
13147
13144
13143
13140
13119
13109
13101
13078
13076
13072
13055
13049
13008
12997
12994
12990
12982
12969
12949
12942
12936
12933
12908
12902
12895
12893
12873
12871
12853
12839
12831
12818
12809
12807
12803
12788
12785
12784
12781
12775
12774
12772
12726
12712
12711
12710
12704
12701
12697
12696
12687
12673
12670
12652
12651
12649
12641
12635
12634
12630
12627
12621
12607
12593
12592
12571
12569
12568
12565
12564
12531
12525
12494
12492
12485
12465
12462
12458
12454
12443
12426
12418
12415
12413
12410
12405
12395
12388
12370
12357
12355
12342
12338
12337
12330
12329
12325
12321
12317
12308
12304
12295
12292
12284
12283
12281
12279
12246
12238
12224
12217
12204
12198
12194
12186
12178
12157
12154
12145
12141
12122
12120
12114
12107
12097
12091
12086
12084
12079
12061
12058
12044
12043
12025
11988
11985
11982
11968
11951
11942
11940
11938
11935
11930
11924
11921
11917
11913
11903
11899
11898
11891
11883
11882
11858
11857
11856
11832
11830
11828
11824
11820
11817
11813
11802
11797
11794
11791
11784
11768
11767
11766
11765
11758
11754
11740
11736
11731
11722
11715
11706
11703
11702
11695
11688
11682
11678
11669
11668
11662
11644
11614
11612
11576
11570
11537
11532
11522
11519
11518
11517
11516
11505
11499
11490
11485
11469
11468
11463
11461
11451
11450
11447
11445
11435
11425
11411
11386
11384
11364
11344
11336
11333
11331
11328
11324
11323
11316
11312
11310
11286
11282
11276
11272
11269
11267
11257
11255
11252
11246
11233
11223
11214
11204
11203
11193
11187
11183
11169
11167
11158
11152
11105
11093
11082
11076
11069
11065
11064
11052
11031
11030
11026
11020
11019
10996
10990
10989
10985
10976
10957
10949
10947
10944
10940
10939
10937
10922
10905
10902
10896
10874
10872
10838
10832
10811
10790
10785
10773
10771
10770
10764
10748
10737
10728
10721
10717
10714
10708
10692
10687
10683
10680
10666
10664
10656
10653
10650
10635
10632
10624
10616
10611
10603
10601
10563
10554
10544
10533
10520
10519
10508
10504
10500
10499
10484
10473
10458
10453
10445
10444
10442
10441
10433
10423
10417
10413
10412
10404
10381
10365
10356
10355
10352
10351
10348
10337
10336
10319
10303
10293
10290
10288
10283
10277
10259
10250
10248
10247
10240
10239
10217
10215
10193
10188
10187
10185
10174
10167
10164
10145
10143
10141
10135
10134
10126
10108
10103
10102
10092
10084
10079
10068
10062
10060
10054
10050
10043
10017
10000
9996
9979
9958
9955
9928
9926
9915
9907
9900
9899
9891
9884
9866
9861
9846
9845
9844
9821
9816
9811
9784
9782
9778
9760
9747
9743
9740
9728
9714
9709
9700
9686
9667
9657
9650
9642
9633
9632
9614
9613
9604
9601
9596
9593
9586
9584
9577
9563
9561
9521
9518
9517
9506
9490
9481
9466
9465
9464
9462
9459
9456
9441
9424
9423
9421
9411
9381
9370
9368
9361
9359
9349
9337
9332
9323
9321
9309
9306
9298
9293
9284
9282
9276
9275
9265
9255
9254
9240
9235
9231
9230
9216
9204
9193
9182
9171
9170
9168
9143
9133
9125
9110
9098
9086
9081
9077
9075
9065
9063
9054
9052
9040
9035
9034
9033
9030
9021
9020
9011
9008
8996
8979
8978
8975
8971
8970
8965
8959
8954
8953
8942
8932
8931
8912
8898
8896
8895
8883
8882
8873
8863
8849
8845
8838
8837
8825
8811
8803
8800
8792
8781
8777
8772
8771
8768
8764
8749
8743
8723
8722
8716
8715
8711
8694
8683
8663
8662
8661
8652
8629
8623
8621
8596
8594
8591
8590
8586
8582
8566
8563
8560
8558
8546
8531
8526
8511
8497
8480
8473
8471
8467
8466
8464
8459
8452
8451
8449
8438
8432
8413
8406
8402
8391
8369
8355
8350
8341
8318
8302
8295
8294
8293
8291
8279
8257
8226
8211
8209
8170
8151
8147
8146
8141
8126
8084
8081
8076
8038
8032
8031
8004
7998
7992
7987
7947
7922
7895
7893
7888
7884
7870
7869
7845
7830
7818
7814
7803
7794
7792
7778
7757
7756
7755
7747
7746
7730
7709
7705
7699
7693
7690
7685
7674
7658
7656
7648
7646
7600
7585
7550
7546
7534
7530
7524
7515
7513
7492
7490
7460
7446
7433
7432
7430
7425
7417
7411
7404
7398
7380
7377
7375
7368
7367
7362
7324
7314
7309
7291
7280
7265
7241
7232
7221
7219
7217
7192
7188
7170
7146
7144
7132
7126
7124
7120
7117
7112
7080
7070
7068
7064
7060
7058
7040
7037
7023
7018
6994
6981
6970
6965
6963
6934
6925
6917
6912
6908
6905
6901
6900
6897
6888
6881
6874
6851
6835
6833
6828
6826
6819
6815
6810
6777
6774
6771
6770
6745
6738
6737
6732
6713
6689
6679
6666
6650
6645
6622
6621
6608
6601
6595
6588
6583
6578
6576
6573
6567
6554
6525
6503
6501
6492
6489
6481
6470
6466
6453
6444
6426
6420
6416
6404
6402
6393
6387
6378
6376
6344
6334
6330
6327
6302
6290
6272
6258
6252
6247
6238
6236
6231
6226
6219
6211
6210
6193
6176
6175
6165
6153
6128
6127
6092
6091
6083
6076
6065
6056
6023
6018
5969
5954
5938
5918
5903
5868
5860
5822
5821
5781
5773
5771
5751
5740
5716
5690
5670
5668
5646
5644
5638
5636
5630
5607
5599
5595
5583
5524
5507
5495
5492
5491
5485
5474
5435
5419
5414
5412
5402
5379
5365
5364
5362
5360
5347
5338
5332
5321
5308
5305
5290
5282
5280
5278
5234
5220
5218
5217
5205
5199
5189
5187
5186
5150
5148
5146
5139
5131
5130
5128
5127
5102
5091
5063
5056
5049
5029
5018
4962
4946
4944
4943
4934
4925
4921
4916
4882
4866
4865
4864
4862
4826
4811
4809
4776
4771
4747
4741
4738
4733
4729
4717
4689
4676
4668
4654
4633
4621
4609
4608
4597
4572
4563
4550
4542
4531
4511
4509
4499
4488
4446
4403
4401
4389
4381
4373
4371
4366
4363
4361
4330
4308
4306
4297
4281
4277
4266
4242
4225
4205
4202
4200
4199
4198
4197
4150
4133
4112
4077
4076
4075
4073
4065
4047
3984
3967
3955
3912
3867
3862
3861
3850
3833
3818
3812
3811
3789
3770
3749
3733
3725
3712
3697
3696
3673
3658
3654
3624
3621
3601
3594
3591
3571
3569
3487
3456
3418
3415
3356
3337
3319
3303
3297
3281
3275
3244
3236
3202
3180
3179
3157
3134
3124
3114
3107
3102
3095
3069
2931
2926
2914
2794
2782
2767
2733
2719
2696
2666
2623
2620
2619
2605
2563
2554
2545
2523
2516
2439
2435
2378
2339
2274
2271
2262
2242
2228
2200
2199
2194
2131
2078
2063
2015
1975
1957
1912
1891
1861
1855
1823
1743
1708
1703
1670
1569
1561
1558
1550
1481
1439
1423
1418
1308
1214
1172
1156
1082
1073
1062
1033
1026
910
869
765
755
696
666
654
628
556
490
385
167
21931
21921
21919
21852
21826
21790
21781
21780
21773
21740
21732
21638
21601
21576
21572
21527
21487
21486
21482
21472
21450
21440
21419
21391
21372
21346
21341
21291
21234
21194
21151
21142
21094
21081
21032
20996
20973
20971
20860
20848
20826
20822
20814
20787
20785
20778
20767
20736
20724
20717
20706
20696
20680
20674
20656
20641
20610
20601
20597
20584
20549
20547
20545
20532
20475
20440
20405
20393
20353
20304
20292
20291
20247
20220
20219
20216
20180
20155
20154
20152
20132
20131
20105
20098
20097
20092
20080
20076
20041
20001
19997
19993
19951
19924
19919
19903
19902
19897
19893
19874
19847
19846
19815
19806
19768
19766
19759
19750
19740
19729
19727
19725
19719
19668
19662
19656
19643
19625
19618
19594
19547
19522
19521
19520
19508
19506
19505
19493
19485
19480
19472
19471
19460
19429
19423
19399
19376
19353
19335
19307
19306
19272
19251
19235
19196
19180
19176
19174
19160
19146
19132
19131
19124
19122
19117
19112
19093
19084
19070
19066
19064
19061
19053
19039
19019
18997
18995
18992
18975
18969
18968
18967
18966
18962
18961
18955
18949
18942
18940
18934
18925
18889
18883
18881
18874
18859
18853
18850
18827
18820
18818
18816
18798
18797
18770
18764
18731
18721
18719
18716
18704
18685
18684
18682
18677
18675
18669
18648
18647
18645
18643
18640
18639
18633
18631
18630
18627
18618
18609
18602
18582
18574
18566
18560
18559
18545
18540
18524
18504
18503
18498
18494
18490
18487
18486
18484
18481
18474
18462
18451
18441
18419
18402
18396
18392
18376
18373
18363
18361
18358
18347
18343
18342
18324
18320
18311
18301
18287
18282
18267
18265
18262
18261
18253
18252
18251
18247
18237
18233
18221
18215
18208
18192
18180
18179
18177
18174
18172
18166
18152
18148
18147
18141
18138
18122
18119
18116
18113
18102
18093
18091
18086
18076
18074
18058
18049
18047
18044
18042
18033
18023
18008
18005
